sexjun/CDS_STM32F429IGT6/Core/Src/cds_gpio_exit.c
#include "main.h"
#include "stm32f4xx_hal.h"
#include <stdint.h>
#include "cds_gpio_exit.h"
#include "gpio.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_uart.h"
#include "usart.h"

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == GPIO_PIN_0) // Assuming GPIO_PIN_0 is connected to KEY_1
    {
        key1_toggle_red_led_pin();
    }
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
    if (huart->Instance == USART3) {
        HAL_UART_Transmit_IT(&huart3, uart3_rx_buffer, sizeof(uart3_rx_buffer)); // Echo back received data
        // Check the received command and toggle the corresponding LED
        if(uart3_rx_buffer[0] == 'R') {
            HAL_GPIO_TogglePin(LED_R_GPIO_Port, LED_R_Pin); // Toggle red LED
        } else if(uart3_rx_buffer[0] == 'G') {
            HAL_GPIO_TogglePin(LED_G_GPIO_Port, LED_G_Pin); // Toggle green LED
        } else if(uart3_rx_buffer[0] == 'B') {
            HAL_GPIO_TogglePin(LED_B_GPIO_Port, LED_B_Pin); // Toggle blue LED
        } else {
            uint8_t response[] = "Invalid Command";
            HAL_UART_Transmit_IT(huart, response, sizeof(response));
        }
        HAL_UARTEx_ReceiveToIdle_IT(&huart3, uart3_rx_buffer, sizeof(uart3_rx_buffer)); // Re-enable the interrupt for next reception
        __HAL_DMA_DISABLE_IT(huart3.hdmarx, DMA_IT_HT);
    }
}

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size) {
    if (huart->Instance == USART3) {
        HAL_UART_Transmit_DMA(&huart3, uart3_rx_buffer, Size); // Echo back received data
        // Check the received command and toggle the corresponding LED
        if(uart3_rx_buffer[0] == 'R') {
            HAL_GPIO_TogglePin(LED_R_GPIO_Port, LED_R_Pin); // Toggle red LED
            HAL_GPIO_WritePin(LED_G_GPIO_Port, LED_B_Pin | LED_G_Pin, GPIO_PIN_RESET); // Ensure other LEDs are off
        } else if(uart3_rx_buffer[0] == 'G') {
            HAL_GPIO_TogglePin(LED_G_GPIO_Port, LED_G_Pin); // Toggle green LED
        } else if(uart3_rx_buffer[0] == 'B') {
            HAL_GPIO_TogglePin(LED_B_GPIO_Port, LED_B_Pin); // Toggle blue LED
        } else {
            uint8_t response[] = "Invalid Command";
            HAL_UART_Transmit_DMA(huart, response, sizeof(response));
        }
        HAL_UARTEx_ReceiveToIdle_DMA(&huart3, uart3_rx_buffer, sizeof(uart3_rx_buffer)); // Re-enable the interrupt for next reception
        // 关闭DMA传输过半中断（HAL库默认开启，但我们只需要接收完成中断）
        __HAL_DMA_DISABLE_IT(huart3.hdmarx, DMA_IT_HT);
    }
}
